# TODO: Сюда вставить текст рассылки
SPAM_TEXT: str = "lorem ipsum dolor sit amet"

START_MESSAGE: str = "Привет! Это бот Андрея. Нажми забрать подарок, а затем продолжи."
START_MESSAGE_BTN_TEXT: str = "Забрать подарок"

# TODO: Вот сюда вставить ссылку(https://google.com/ - ссылка, имя ссылки - как он будет показываться людям> писать без знаков <> ссылку)
# TODO: f'Вот твой подарок: 🎁 <a href="https://google.com/">ссылка на гугл</a>' - вот так
MESSAGE_2: str = f'Вот твой подарок: 🎁 <a href="https://google.com/">имя ссылки</a>'
MESSAGE_2_BTN_TEXT: str = "Хочу узнать!🔥"

MESSAGE_3: str = ('Знаешь, у меня есть всего пара секунд, чтобы раскрыть перед тобой перспективы мира,'
                  ' где Искусственный Интеллект (ИИ) – не просто сложная технология,'
                  ' а реальный путь к достижению успеха. Может быть, ты слышал скептические мнения:'
                  ' "Это лохотрон", "Это нереально", "Это просто слив времени и денег".'
                  ' Но давай на мгновение забудем об этих сомнениях.'
                  ' Представь, если бы каждый новатор в истории останавливался перед подобными словами.'
                  ' Как бы выглядел наш мир сейчас?')
MESSAGE_3_BTN_TEXT: str = "Идем дальше! 🔥"

MESSAGE_4: str = ('Вспомни начало 2000-х, когда интернет только начал проникать в каждый дом.'
                  ' Тогда многие видели в нем лишь временную забаву,'
                  ' не представляя, как он кардинально изменит нашу жизнь, работу, общение.'
                  ' Сегодня ИИ находится на таком же рубеже.'
                  ' Компании типа Google и Tesla уже используют ИИ для выполнения задач,'
                  ' о которых мы могли только мечтать десять лет назад. Применение ИИ для автономного вождения,'
                  ' персонализированной медицины – это уже не фантастика, а наша реальность.')
MESSAGE_4_BTN_TEXT: str = "Следующий шаг!🔥"

MESSAGE_5: str = ('ИИ не просто активно используется в различных сферах - он переворачивает их.'
                  ' В медицине ИИ помогает в диагностике заболеваний с точностью,'
                  ' недостижимой для человеческого глаза. В финансах алгоритмы ИИ анализируют рынок,'
                  ' предсказывая тенденции и оптимизируя инвестиции.'
                  ' А цифровое искусство, созданное с помощью ИИ, открывает новую страницу в истории арта.')
MESSAGE_5_BTN_TEXT: str = "Что же это означает ❓"

MESSAGE_6: str = ('Это означает, что ИИ может стать твоим личным помощником в бизнесе.'
                  ' От автоматизации рутинных задач до разработки инновационных'
                  ' продуктов и услуг - возможности безграничны. Ты можешь стать частью рынка,'
                  ' который растет с каждым днем, открывая новые горизонты для предпринимателей и креативщиков.'
                  ' Это не просто следование тренду, это участие в создании будущего.')
MESSAGE_6_BTN_TEXT: str = "Отлично! Продолжаем! ✅"

MESSAGE_7: str = ('Владение информацией - это только начало. Применение этой информации - истинная сила.'
                  ' Мой курс предлагает не просто знания о работе ИИ; он дает реальные инструменты для'
                  ' его использования в заработке. Ты научишься не просто разбираться в ИИ,'
                  ' но и использовать его в своих целях. В том числе ChatGPT.'
                  ' Это твой шанс выстроить собственную систему по заработку денег.')
MESSAGE_7_BTN_TEXT: str = "Ух ты! То есть ты хочешь сказать, что..."

MESSAGE_8: str = ('Представь себе мир, где твои идеи и проекты поддерживаются самыми передовыми технологиями.'
                  ' Где каждое твое решение основано на данных, анализируемых с невероятной точностью и скоростью.'
                  ' Этот мир не за горами, он уже здесь, и ты можешь стать его частью.'
                  ' Мой курс - это мост в этот новый мир. Это твой шанс не просто адаптироваться к изменениям,'
                  ' но и возглавить их, стать лидером в эре ИИ.'
                  ' Не упускай свой шанс стать пионером в этом удивительном мире новых технологий.\n')
MESSAGE_8_BTN_TEXT: str = "Круто! А что теперь?"
